metadata-api-renameMetadata.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <met:SessionHeader>
            <met:sessionId>{{SessionId}}</met:sessionId>
        </met:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <met:renameMetadata>
            <met:type>CustomObject</met:type>
              <met:oldFullName>Invoice__c</met:oldFullName>
              <met:newFullName>Invoice_Header__c</met:newFullName>
    </soapenv:Body>
</soapenv:Envelope>
